<a href="https://colab.research.google.com/github/LIVERA-S/21-22_INFORMATICA_LIVERA-4EINF/blob/main/Pandas_Indexing-and-selecting-data.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# Indicizzazione e selezione dei dati

In [ ]:
%matplotlib inline

import pandas as pd

In [ ]:
# redefining the example objects

# series
population = pd.Series({'Germany': 81.3, 'Belgium': 11.3, 'France': 64.3, 
                        'United Kingdom': 64.9, 'Netherlands': 16.9})

# dataframe
data = {'country': ['Belgium', 'France', 'Germany', 'Netherlands', 'United Kingdom'],
        'population': [11.3, 64.3, 81.3, 16.9, 64.9],
        'area': [30510, 671308, 357050, 41526, 244820],
        'capital': ['Brussels', 'Paris', 'Berlin', 'Amsterdam', 'London']}
countries = pd.DataFrame(data)
countries

          country  population    area    capital
0         Belgium        11.3   30510   Brussels
1          France        64.3  671308      Paris
2         Germany        81.3  357050     Berlin
3     Netherlands        16.9   41526  Amsterdam
4  United Kingdom        64.9  244820     London

In [ ]:
countries[countries.country == "France"]["area"]

1    671308
Name: area, dtype: int64

In [ ]:
countries[2 : 4]

       country  population    area    capital
2      Germany        81.3  357050     Berlin
3  Netherlands        16.9   41526  Amsterdam

Impostiamo come index la colonna "country" del dataframe:

In [ ]:
#
countries = countries.set_index('country')
countries

                population    area    capital
country
Belgium               11.3   30510   Brussels
France                64.3  671308      Paris
Germany               81.3  357050     Berlin
Netherlands           16.9   41526  Amsterdam
United Kingdom        64.9  244820     London

## Selezionare i dati

Una delle caratteristiche di pandas è che ci permette di selezionare i dati attraverso le righe e colonne, ora però dobbiamo distinguerli:

Per selezionare una solo colonna:

In [ ]:
countries['area']

country
Belgium            30510
France            671308
Germany           357050
Netherlands        41526
United Kingdom    244820
Name: area, dtype: int64

per selezionare più di una colonna:

In [ ]:
countries[['area', 'population']]

                  area  population
country
Belgium          30510        11.3
France          671308        64.3
Germany         357050        81.3
Netherlands      41526        16.9
United Kingdom  244820        64.9

Qua invece vediamo un modo col quale selezionare delle righe usando come "estremi" dei valori presenti nell'index

In [ ]:
countries['Germany':'United Kingdom']

                population    area    capital
country
Germany               81.3  357050     Berlin
Netherlands           16.9   41526  Amsterdam
United Kingdom        64.9  244820     London

### Indicizzazione con `loc` e `iloc`

Per una selezione più avanzata possiamo utilizzare altri modi ovvero:
    
* `loc`: selezione da label
* `iloc`: selezione da posizione

Per selezionare un singolo elemento:

In [ ]:
#
countries.loc['Germany', 'area']

357050

Per selezionre più elementi:

In [ ]:
#
countries.loc[['France','Germany'], ['area', 'population']]

           area  population
country
France   671308        64.3
Germany  357050        81.3

---
Invece `iloc` selezione gli elementi attraverso la posizione:

In [ ]:
#
countries.iloc[0:2,1:3]

           area   capital
country
Belgium   30510  Brussels
France   671308     Paris

Questi metodi di indicizzazione possono essere anche usati per assegnare del valori:

In [ ]:
#
countries2 = countries.copy()
countries2.loc['Belgium':'Germany', 'population'] = 10

In [ ]:
countries2.iloc[0:3,1] = 1000

In [ ]:
countries2

                population    area    capital
country
Belgium               10.0    1000   Brussels
France                10.0    1000      Paris
Germany               10.0    1000     Berlin
Netherlands           16.9   41526  Amsterdam
United Kingdom        64.9  244820     London

## Selezione dei dati con condizone

In questo esempio possiamo vedere come applicare una condione ai valori di una colonna:

In [ ]:
countries['area'] > 100000

country
Belgium           False
France             True
Germany            True
Netherlands       False
United Kingdom     True
Name: area, dtype: bool

Qua invece vediamo come selezionare e visulaizzare le colonne nelle quali la condizione è vera (True):

In [ ]:
countries[countries['area'] > 100000]

                population    area capital
country
France                64.3  671308   Paris
Germany               81.3  357050  Berlin
United Kingdom        64.9  244820  London

---

<div class="alert alert-success">
    <b>ESERCIZIO</b>: aggiungi una colonna "density" con la densità della popolazione (nota: la colonna della popolazione è espressa in milioni)
</div>

In [ ]:
countries["density"] = countries['population']*1000000/countries['area']
countries

          country  population    area    capital     density
0         Belgium        11.3   30510   Brussels  370.370370
1          France        64.3  671308      Paris   95.783158
2         Germany        81.3  357050     Berlin  227.699202
3     Netherlands        16.9   41526  Amsterdam  406.973944
4  United Kingdom        64.9  244820     London  265.092721

<div class="alert alert-success">
    <b>ESERCIZIO</b>: seleziona la capitale e la colonna della popolazione di quei paesi in cui la densità è maggiore di 300
</div>

In [ ]:
countries[(countries.density > 300)][['country','density','population']]

       country     density  population
0      Belgium  370.370370        11.3
3  Netherlands  406.973944        16.9

<div class="alert alert-success">
    <b>ESERCIZIO</b>: aggiungi una colonna 'density_ratio' con il rapporto tra la densità e la densità media
</div>

In [ ]:
countries["density_ratio"] = countries['density'] / countries['density'].mean()
countries

          country  population    area    capital     density  density_ratio
0         Belgium        11.3   30510   Brussels  370.370370       1.355755
1          France        64.3  671308      Paris   95.783158       0.350618
2         Germany        81.3  357050     Berlin  227.699202       0.833502
3     Netherlands        16.9   41526  Amsterdam  406.973944       1.489744
4  United Kingdom        64.9  244820     London  265.092721       0.970382

<div class="alert alert-success">
    <b>ESERCIZIO</b>: cambia la capitale degli UK in Cambridge
</div>

In [ ]:
countries3 = countries.copy()
#countries3.loc['United Kindom','capital'] = "Cambridge"
#countries3.loc[4,'capital'] = "Cambridge"
countries3.iloc[4 ,3] = "Cambridge"
countries3

          country  population    area    capital     density  density_ratio
0         Belgium        11.3   30510   Brussels  370.370370            NaN
1          France        64.3  671308      Paris   95.783158            NaN
2         Germany        81.3  357050     Berlin  227.699202            NaN
3     Netherlands        16.9   41526  Amsterdam  406.973944            NaN
4  United Kingdom        64.9  244820  Cambridge  265.092721            NaN

<div class="alert alert-success">
    <b>ESERCIZIO</b>: seleziona tutti i paesi la cui densità di popolazione è compresa tra 100 e 300 persone/km²
</div>

In [ ]:
countries[(countries['density'] >= 100) & (countries.density <= 300)]

          country     density
2         Germany  227.699202
4  United Kingdom  265.092721

## Metodo `isin` e metodi per le Stringhe

Il metodo `isin` è molto utile per selezionare delle righe nelle quali è presente un certo valore:

In [ ]:
s = countries['capital']

In [ ]:
s.isin(['Berlin', 'London'])

country
Belgium           False
France            False
Germany            True
Netherlands       False
United Kingdom     True
Name: capital, dtype: bool

Il metodo può essere anche usato per filtrare il dataframe secondo una condizione

In [ ]:
countries[countries['capital'].isin(['Berlin', 'London'])]

                population    area capital
country
Germany               81.3  357050  Berlin
United Kingdom        64.9  244820  London

Suppponiamo che vogliamo selezionare tutti i dati delle capitali che iniziano con la 'B'. In Python esiste la funzione `startswith`:

In [ ]:
'Berlin'.startswith('B')

True

In Pandas possiamo appplicare la funzione a tutti i dati di una colonna, utlizzato però assieme a `str`:

In [ ]:
countries['capital'].str.startswith('B')

country
Belgium            True
France            False
Germany            True
Netherlands       False
United Kingdom    False
Name: capital, dtype: bool

<div class="alert alert-success">
    <b>ESERCIZIO</b>: seleziona tutti i paesi che hanno nomi di capitali con più di 7 caratteri
</div>

<div class="alert alert-success">
    <b>ESERCIZIO</b>: seleziona tutti i paesi che hanno nomi di capitali che contengono la sequenza di caratteri "am"
</div>

## Pitfall: chained indexing (and the 'SettingWithCopyWarning')

In [ ]:
countries.loc['Belgium', 'capital'] = 'Ghent'

In [ ]:
countries

                population    area    capital
country
Belgium               11.3   30510      Ghent
France                64.3  671308      Paris
Germany               81.3  357050     Berlin
Netherlands           16.9   41526  Amsterdam
United Kingdom        64.9  244820     London

In [ ]:
countries['capital']['Belgium'] = 'Antwerp'

/usr/local/lib/python3.7/dist-packages/ipykernel_launcher.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  """Entry point for launching an IPython kernel.

In [ ]:
countries

                population    area    capital
country
Belgium               11.3   30510    Antwerp
France                64.3  671308      Paris
Germany               81.3  357050     Berlin
Netherlands           16.9   41526  Amsterdam
United Kingdom        64.9  244820     London

In [ ]:
countries[countries['capital'] == 'Antwerp']['capital'] = 'Brussels'

/usr/local/lib/python3.7/dist-packages/ipykernel_launcher.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  """Entry point for launching an IPython kernel.

In [ ]:
countries

                population    area    capital
country
Belgium               11.3   30510    Antwerp
France                64.3  671308      Paris
Germany               81.3  357050     Berlin
Netherlands           16.9   41526  Amsterdam
United Kingdom        64.9  244820     London

How to avoid this?

* Use `loc` instead of chained indexing if possible!
* Or `copy` explicitly if you don't want to change the original data.

## More exercises!

For the quick ones among you, here are some more exercises with some larger dataframe with film data. These exercises are based on the [PyCon tutorial of Brandon Rhodes](https://github.com/brandon-rhodes/pycon-pandas-tutorial/) (so all credit to him!) and the datasets he prepared for that. You can download these data from here: [`titles.csv`](https://drive.google.com/open?id=0B3G70MlBnCgKajNMa1pfSzN6Q3M) and [`cast.csv`](https://drive.google.com/open?id=0B3G70MlBnCgKal9UYTJSR2ZhSW8) and put them in the `/data` folder.

In [ ]:
cast = pd.read_csv('data/cast.csv')
cast.head()

FileNotFoundError: ignored

In [ ]:
titles = pd.read_csv('data/titles.csv')
titles.head()

<div class="alert alert-success">
    <b>EXERCISE</b>: How many movies are listed in the titles dataframe?
</div>

<div class="alert alert-success">
    <b>EXERCISE</b>: What are the earliest two films listed in the titles dataframe?
</div>

<div class="alert alert-success">
    <b>EXERCISE</b>: How many movies have the title "Hamlet"?
</div>

<div class="alert alert-success">
    <b>EXERCISE</b>: List all of the "Treasure Island" movies from earliest to most recent.
</div>

<div class="alert alert-success">
    <b>EXERCISE</b>: How many movies were made from 1950 through 1959?
</div>

<div class="alert alert-success">
    <b>EXERCISE</b>: How many roles in the movie "Inception" are NOT ranked by an "n" value?
</div>

<div class="alert alert-success">
    <b>EXERCISE</b>: But how many roles in the movie "Inception" did receive an "n" value?
</div>

<div class="alert alert-success">
    <b>EXERCISE</b>: Display the cast of "North by Northwest" in their correct "n"-value order, ignoring roles that did not earn a numeric "n" value.
</div>

<div class="alert alert-success">
    <b>EXERCISE</b>: How many roles were credited in the silent 1921 version of Hamlet?
</div>

<div class="alert alert-success">
    <b>EXERCISE</b>: List the supporting roles (having n=2) played by Cary Grant in the 1940s, in order by year.
</div>